app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def index
    @users = User.find(:all, :order => :name)